{
  "success": {
    "REGISTER_SUCCESS": "Đăng ký tài khoản thành công! Chào mừng bạn đến với Shopsifu",
    "SEND_OTP_SUCCESS": "Mã xác thực đã được gửi đến email của bạn. Vui lòng kiểm tra hộp thư đến",
    "LOGIN_SUCCESS": "Đăng nhập thành công",
    "REFRESH_TOKEN_SUCCESS": "Làm mới phiên thành công",
    "LOGOUT_SUCCESS": "Bạn đã đăng xuất thành công",
    "FORGOT_PASSWORD_SUCCESS": "Yêu cầu đặt lại mật khẩu đã được gửi. Vui lòng kiểm tra email của bạn",
    "SETUP_2FA_SUCCESS": "Đã tạo mã QR để thiết lập xác thực hai yếu tố",
    "DISABLE_2FA_SUCCESS": "Xác thực hai yếu tố đã được vô hiệu hóa",
    "CSRF_TOKEN_SUCCESS": "Token CSRF đã được tạo thành công",
    "PASSWORD_RESET_SUCCESS": "Mật khẩu của bạn đã được đặt lại thành công",
    "PASSWORD_CHANGE_SUCCESS": "Mật khẩu của bạn đã được thay đổi thành công",
    "GOOGLE_AUTH_SUCCESS": "Xác thực Google thành công",
    "GOOGLE_UNLINK_SUCCESS": "Tài khoản Google đã được hủy liên kết thành công",
    "EMAIL_VERIFICATION_SUCCESS": "Email đã được xác thực thành công",
    "ACCOUNT_ACTIVATION_SUCCESS": "Tài khoản đã được kích hoạt thành công"
  },
  "error": {
    "EMAIL_ALREADY_EXISTS": "Địa chỉ email này đã được đăng ký",
    "EMAIL_NOT_FOUND": "Không tìm thấy tài khoản với email này",
    "INVALID_PASSWORD": "Email hoặc mật khẩu không chính xác",
    "PASSWORDS_NOT_MATCH": "Mật khẩu và xác nhận mật khẩu không khớp",
    "SAME_PASSWORD": "Mật khẩu mới phải khác với mật khẩu hiện tại",
    "WEAK_PASSWORD": "Mật khẩu quá yếu, vui lòng chọn mật khẩu mạnh hơn",
    "INVALID_CREDENTIALS": "Thông tin đăng nhập không hợp lệ. Vui lòng kiểm tra lại email và mật khẩu của bạn",
    "USER_NOT_FOUND": "Người dùng không tồn tại",
    "USER_NOT_ACTIVE": "Tài khoản chưa được kích hoạt hoặc đã bị khóa",
    "USER_BLOCKED": "Tài khoản của bạn đã bị khóa. Vui lòng liên hệ hỗ trợ",
    "ACCOUNT_LOCKED": "Tài khoản của bạn đã tạm thời bị khóa do quá nhiều lần đăng nhập thất bại",
    "ROLE_NOT_FOUND": "Không tìm thấy vai trò mặc định cho người dùng",
    "INSUFFICIENT_PERMISSIONS": "Bạn không đủ quyền để thực hiện hành động này",

    "INVALID_OTP": "Mã xác thực không chính xác hoặc đã hết hạn",
    "OTP_EXPIRED": "Mã xác thực đã hết hạn. Vui lòng yêu cầu mã mới",
    "OTP_SENDING_FAILED": "Gửi mã xác thực không thành công. Vui lòng thử lại sau",
    "OTP_MAX_ATTEMPTS": "Bạn đã nhập sai mã quá nhiều lần. Vui lòng yêu cầu mã mới",
    "OTP_REQUIRED": "Yêu cầu mã xác thực để tiếp tục",

    "INVALID_TOTP": "Mã xác thực hai yếu tố không hợp lệ",
    "TOTP_REQUIRED": "Yêu cầu mã xác thực hai yếu tố",
    "TOTP_ALREADY_ENABLED": "Xác thực hai yếu tố đã được kích hoạt cho tài khoản này",
    "TOTP_NOT_ENABLED": "Xác thực hai yếu tố chưa được kích hoạt cho tài khoản này",
    "INVALID_TOTP_AND_CODE": "Bạn chỉ nên truyền mã xác thực 2FA hoặc mã OTP. Không được truyền cả 2",
    "DISABLE_2FA_REQUIRES_CODE": "Yêu cầu mã xác thực để vô hiệu hóa 2FA",
    "INVALID_RECOVERY_CODE": "Mã khôi phục không hợp lệ hoặc đã được sử dụng",

    "REFRESH_TOKEN_REQUIRED": "Yêu cầu làm mới phiên không hợp lệ",
    "INVALID_REFRESH_TOKEN": "Phiên đăng nhập của bạn đã hết hạn. Vui lòng đăng nhập lại",
    "REFRESH_TOKEN_REUSED": "Phát hiện hành vi sử dụng lại Refresh Token. Vì lý do bảo mật, tất cả các phiên đã bị vô hiệu hóa",
    "ACCESS_TOKEN_EXPIRED": "Phiên làm việc của bạn đã hết hạn. Vui lòng đăng nhập lại",
    "INVALID_ACCESS_TOKEN": "Token xác thực không hợp lệ hoặc đã hết hạn",
    "TOKEN_BLACKLISTED": "Token đã bị vô hiệu hóa",

    "SESSION_NOT_FOUND": "Không tìm thấy phiên làm việc",
    "SESSION_EXPIRED": "Phiên làm việc đã hết hạn",
    "SESSION_REVOKED": "Phiên làm việc đã bị thu hồi. Vui lòng đăng nhập lại",
    "SESSION_USER_MISMATCH": "Phiên làm việc không thuộc về người dùng này",
    "INVALID_SESSION": "Phiên làm việc không hợp lệ",

    "DEVICE_NOT_FOUND": "Không tìm thấy thiết bị được chỉ định",
    "DEVICE_NOT_TRUSTED": "Thiết bị chưa được xác thực. Vui lòng xác thực thiết bị",
    "SUSPICIOUS_DEVICE": "Phát hiện thiết bị đáng ngờ. Vui lòng xác thực danh tính",

    "GOOGLE_AUTH_ERROR": "Đã có lỗi xảy ra khi xác thực với Google. Vui lòng thử lại",
    "GOOGLE_USER_INFO_ERROR": "Không thể lấy thông tin người dùng từ Google. Vui lòng thử lại",
    "GOOGLE_CALLBACK_ERROR": "Đã xảy ra lỗi trong quá trình xác thực với Google. Vui lòng thử lại",
    "GOOGLE_ACCOUNT_LINKED": "Tài khoản Google này đã được liên kết với một tài khoản khác",
    "GOOGLE_NOT_LINKED": "Tài khoản của bạn chưa được liên kết với Google",
    "INVALID_OAUTH_STATE": "Trạng thái OAuth không hợp lệ",
    "OAUTH_CANCELLED": "Yêu cầu OAuth đã bị hủy",

    "INVALID_CSRF_TOKEN": "Mã CSRF không hợp lệ hoặc đã hết hạn. Vui lòng thử lại",
    "CSRF_TOKEN_MISSING": "Thiếu mã CSRF. Vui lòng tải lại trang",

    "VERIFICATION_CODE_INVALID": "Mã xác thực không hợp lệ hoặc đã hết hạn",
    "VERIFICATION_CODE_NOT_FOUND": "Không tìm thấy mã xác thực phù hợp",
    "VERIFICATION_REQUIRED": "Yêu cầu xác thực để tiếp tục",
    "EMAIL_NOT_VERIFIED": "Email chưa được xác thực",

    "RATE_LIMIT_EXCEEDED": "Bạn đã thực hiện quá nhiều yêu cầu. Vui lòng thử lại sau",
    "SERVICE_UNAVAILABLE": "Dịch vụ tạm thời không khả dụng. Vui lòng thử lại sau",
    "MAINTENANCE_MODE": "Hệ thống đang trong chế độ bảo trì. Vui lòng thử lại sau"
  },
  "messages": {
    "LOGIN_2FA_REQUIRED": "Tài khoản của bạn được bảo vệ bằng xác thực hai yếu tố. Vui lòng nhập mã để tiếp tục",
    "LOGIN_OTP_REQUIRED": "Chúng tôi đã gửi một mã xác minh đến email của bạn để xác nhận đăng nhập",
    "DEVICE_NEW_LOGIN": "Đăng nhập từ thiết bị mới được phát hiện",
    "ACCOUNT_SECURITY_CHECK": "Đang thực hiện kiểm tra bảo mật tài khoản",
    "PASSWORD_WILL_EXPIRE": "Mật khẩu của bạn sẽ hết hạn trong {days} ngày",
    "SUSPICIOUS_ACTIVITY": "Phát hiện hoạt động đáng ngờ trên tài khoản của bạn"
  }
}
